#include <iostream>
#include <iomanip>
using namespace std;

int main() {
    



    //-----------------------------------------------
    /*
              Структура выбора(ветвления)

                    - единственный выбор
                            if...
                    - двойной выбор
                            if...else
                            ?:
                    - множественный выбор
                            if...else  if...else   if...else
                            switch
    */
   
    
    //---------------------------------------------------------
    /*
    Определить порядковый  номер дня в году по введенной дате
    с учетом високосного года.

    Не делаем проверку на правильность ввода даты.

    5  3  2021
    31+28/29+5=64/65

    30:  4  6  9  11

    */

    /*int day, month, year, number, febr;
    bool vis;
    cout << "\nВедите день, месяц, год: ";
    cin >> day >> month >> year;*/

    //febr = ((year % 4 == 0 && year % 100 != 0 || year % 400 == 0) ? 29 : 28);
    //
    //vis = (year % 4 == 0 && year % 100 != 0 || year % 400 == 0);

    //switch (month)
    //{
    //case 1: number = day; break;
    //case 2: number = 31 + day; break;
    //case 3: number = 31 + febr + day; break;
    ////case 3: number = 31 + 28 + vis + day; break;
    //case 4: number = 31 + febr + 31 + day; break;
    //case 5: number = 31 + febr + 31 + 30 + day; break;
    //case 6: number = 31 + febr + 31 + 30 + 31 + day; break;
    //case 7: number = 31 + febr + 31 + 30 + 31 + 30 + day; break;
    //case 8: number = 31 + febr + 31 + 30 + 31 + 30 + 31 + day; break;
    //case 9: number = 31 + febr + 31 + 30 + 31 + 30 + 31 + 31 + day; break;
    //case 10: number = 31 + febr + 31 + 30 + 31 + 30 + 31 + 31 + 30 + day; break;
    //case 11: number = 31 + febr + 31 + 30 + 31 + 30 + 31 + 31 + 30 + 31 + day; break;
    //case 12: number = 31 + febr + 31 + 30 + 31 + 30 + 31 + 31 + 30 + 31 + 30 + day; break;
    //}

    //cout << "\nПорядковый номер дня в году: " << number << endl;


    //---------------------------------------------------------
    // Фрагмент кода...
    //bool correct_day = true;


    //if (day >= 1 && day <= 31)
    //{
    //    if (day == 31 && (month == 4 || month == 6 || month == 9 || month == 11))
    //    {
    //        correct_day = false;
    //    }
    //   else if (month == 2 && (day == 31 || day == 30 || (day == 29 && febr != 29)))
    //        correct_day = false;
    //}
    //else {
    //    correct_day = false;
    //}
    //
    //if (correct_day == true)
    //    cout << "Ok";
    //else cout << "Error";


    //---------------------------------------------------------
    //bool p = true;

    //if (p == true)  // if(p)
    //    cout << "\nПравда";
    //else cout << "\nЛожь";

    //if (p)
    //    cout << "\nПравда";
    //else cout << "\nЛожь";

    //if(p==false) // if (!p)
    //    cout << "\nЛожь";
    //else cout << "\nПравда";

    //if (!p)
    //    cout << "\nЛожь";
    //else cout << "\nПравда";

    //int a = 6;
    ////if (a % 2 != 0)
    //if (a % 2)
    //   cout << "\nНе  Четное";
    //else cout << "\nЧетное";

    //// if (a % 2 == 0)
    //if (!(a % 2))
    //    cout << "\nЧетное";
    //else cout << "\nНе Четное";


    //int x = -10;
    //if (x)
    //    cout << "\nx = " << x;
    //else 
    //    cout << "No";

    //bool t = -10;
    //cout << "\nt = " << t;

    //bool tmp = "10";
    //cout << endl << tmp;

    //---------------------------------------------------------
    // Запятая между операторами

    //int a, b;
    //cin >> a;
    //if (a > 0)
    //    b = 100,
    //    a *= 2, 
    //    cout << "a > 0   ";
    //else 
    //    b = -100, a *= 4;
    //cout << a << "  " << b;

    //cout << endl;
    //if (a > 0) {
    //    b = 100;
    //    a *= 2;
    //    cout << "a > 0   ";
    //}
    //else {
    //    b = -100;
    //    a *= 4;
    //}
    //cout << a << "  " << b;



    // Запятая между операторами:

    // int x = 25, y = 0, z = 0;
    // (x % 5 == 0) ? y = 1, z = -1 : y = -10, z = -100;

    // cout << y << "   " << z << endl;
    // //1  -100


    // (x % 5 == 0) ? y = 1, z = -1 : (y = -10, z = -100);
    // cout << y << "   " << z << endl;
    //1  -1

    system("title Happy New Year! Счастливого Нового Года!");
	//=============================================================
	// Структура повторения----------------------------------------

	/*
	Структура повторения может управляться счетчиком либо условием.

	Конструкции для реализации:
		while ПОКА
		do...while  ДЕЛАТЬ...ПОКА
		for  ДЛЯ
	*/
	
	// Цикл while по счетчику--------------------------------------
	//-------------------------------------------------------------
	/*
	Программа выводит на экран  10 звездочек в ряд.
	*/
	// {
	// 	int k;			// 1. Переменная-счетчик
	// 	k = 0;			// 2. Начальное значение для счетчика

	// 	while (k < 10)	// 3. Проверочное условие окончания цикла
	// 	{
	// 		cout << "* ";
	// 		//k = k + 1;
	// 		//k += 1;
	// 		++k;		// 4. Изменение значения счетчика
	// 		Sleep(500); // Задержка при выводе
	// 	}
	// 	_getch();
	// }
	// Конструкция while может не выполниться ни разу: например while (k > 10)	{}
   
	//-------------------------------------------------------------
	/*
	Программа запрашивает целое число n и символ s,
	и	выводит на экран n символов подряд.

	3 @
	@ @ @
	*/

	//int n, k=0; // k-счетчик
	//char s;
	//cout << "Введи количество символов ";
	//cin >> n;  // 5
	//cout << "Введи  символ ";
	//cin >> s;
	//
	//// Вариант 1
	//while (k < n)
	//{
	//	cout << s;
	//	k++;
	//}
	//cout << "\nk = " << k;  //5
	//cout << endl;
	//
	//// Вариант 2
	//k = n;    // 5
	//while (k > 0) {
	//	cout << s;
	//	k--;
	//}
	//cout << endl;

	//// Вариант 3   используем n как счетчик
	////while (n > 0)
	//while (n)
	//{
	//	cout << s << endl;
	//	n--;
	//}
	//cout << "\nn = " << n;


	//-------------------------------------------------------------
	/*
		Программа выводит на экран числа от 1 до 10.
	*/

	/*int k = 1;
	while (k <= 10)
	{
		cout << k << "  ";
		k++;
	}

	cout << endl;

	k = 1;
	while (k <= 10)
	{
		cout << k++ << "  ";
		
	}


	cout << endl;

	k = 0;
	while (k < 10)
	{
		cout << ++k << "  ";

	}

	cout << endl;

	k = 0;
	while (k++ < 10)
	{
		cout << k << "  ";
	}

	cout << endl;

	k = 0;
	while (k < 10)
	{
		cout << k + 1 << "  ";
		k++;
	}*/

	//-------------------------------------------------------------
	/*
	Программа выводит на экран числа от 10 до 1.
	*/
	/*int k = 10;
	while (k > 0)
	{
		cout << k << " ";
		k--;
	}

	cout << endl;
	k = 10;
	while (k)
	{
		cout << k-- << " ";
	}*/


	//-------------------------------------------------------------
	/*
	Программа запрашивает два числа а и в (а меньше b)
	и выводит на экран числа в диапазоне от а до в.

	Рассчитать сумму чисел от а до в и вывести ее на экран.
	*/
	
	// int a, b, summa = 0, k;
	// cout << "Введи два числа  a < b ";
	// cin >> a >> b;
	// if (a < b)
	// {
	// 	k = a; // начальное значение счетчика
	// 	while (k <= b)
	// 	{
	// 		cout << k << "  ";
	// 		summa += k;  // summa = summa + k;
	// 		k++;
	// 		Sleep(500);
	// 	}
	// 	cout << "\nСумма чисел от " << a << " до " << b << " = " << summa;
	// }
	// else cout << "\nНеверные данные ";
	// _getch();

	// system("clear");
	// cout << "\nHappy New Year! ";
    return 0;
}